#Archivo script para yosys

#Abrimos nuestro disegno
read_verilog modo16bits.v

#elaborate design hierarchy
hierarchy -check -top MODO_16bit

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping ff's to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

#cleanup
clean

#write synthesized design
write_verilog modo_16bits_full_synth.v